app/views/groups/index.html.haml

SELECT `groups`.* FROM `groups` ORDER BY group_name
---
    %tr
      %td= h group.group_name