app/views/links/show.html.haml

SELECT "groups".* FROM "groups" WHERE "groups"."id" = 20 ORDER BY group_name LIMIT 1
---
  %b Group:
  = h @link.group.group_name