app/controllers/groups_controller.rb

  def index
    @groups = Group.all
---
SELECT `groups`.* FROM `groups` ORDER BY group_name

  def show
    @group = Group.find(params[:id])
    @members = Link.where(:group_id, params[:id]).order(:position)
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 3 ORDER BY group_name LIMIT 1
SELECT `links`.* FROM `links` WHERE `links`.`group_id` = 3 ORDER BY position

  def edit
    @group = Group.find(params[:id])
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 7 ORDER BY group_name LIMIT 1

  def create
    @group = Group.new(group_params)
    respond_to do |format|
      if @group.save
---
INSERT INTO `groups` (`group_name`, `created_at`, `updated_at`, `group_description`) VALUES ('jQuery Examples', '2012-06-12 01:20:27', '2012-06-12 01:20:27', 'Various jQuery examples of common situations amnd solutions')

  def update

    redirect_to Group.find(params[:id]).tap { |group|
      group.update!(group_params)
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 15 ORDER BY group_name LIMIT 1
UPDATE `groups` SET `group_name` = 'jQuery Examples', `group_description` = 'Various jQuery examples of common situations amnd solutions', `updated_at` = '2012-06-12 01:20:28' WHERE `groups`.`id` = 15

  def destroy
    @group = Group.find(params[:id])
    respond_to do |format|
      group_link_count= @group.links.count
      if @group.destroy
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 21 ORDER BY group_name LIMIT 1
DELETE FROM `groups` WHERE `groups`.`id` = 21