app/controllers/links_controller.rb

  def update
    @link = Link.find(params[:id])

    respond_to do |format|
      if @link.update_attributes(params[:link])
        flash[:notice] = 'Link was successfully updated.'
        format.html { redirect_to(@link) }
        format.xml  { head :ok }
      else
        @groups = Group.find(:all)
---
SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 55 ORDER BY group_name LIMIT 1