app/controllers/links_controller.rb

SELECT `groups`.* FROM `groups` ORDER BY group_name
---
  def new
    @link = Link.new
    # @link.content_date=Time.new().strftime("%m/%d/%Y")
    @link.content_date=Time.new().to_s[0,10]
    @link.url_address='http://'
    @groups = Group.all.collect { |g| [g.group_name, g.id] }

SELECT `links`.* FROM `links` WHERE `links`.`id` = 7 LIMIT 1
SELECT `groups`.* FROM `groups` ORDER BY group_name
---
  def edit
    @link = Link.find(params[:id])
    if @link.content_date.nil?
      @link.content_date=(Time.new().to_s)[0,10]
    end
    @groups = Group.all.collect { |g| [g.group_name, g.id] }

INSERT INTO `links` (`url_address`, `alt_text`, `group_id`, `position`, `created_at`, `updated_at`, `version_number`, `content_date`) VALUES ('http://test.com', 'examples of common situations amnd solutions', 51, 2, '2012-06-12 01:20:30', '2012-06-12 01:20:30', NULL, NULL)
---
  def create
    @link = Link.new(link_params)

    unless link_params[:content_date].nil?

      the_date = construct_date.to_date.strftime("%Y-%m-%d")
# %Y-%m-%d Date format required for date to save correctly AND tests not to fail !!! @link.content_date = Time.new().strftime("%Y/%m/%d") # %m/%d/%Y makes tests fail.
      @link.update!(content_date: the_date)

    end

    respond_to do |format|
      if @link.save

SELECT `links`.* FROM `links` WHERE `links`.`id` = 15 LIMIT 1
UPDATE `links` SET `url_address` = 'test2', `alt_text` = 'test2', `updated_at` = '2012-06-12 01:20:30' WHERE `links`.`id` = 16
---
  def update
    this_link = Link.find(params[:id])
    this_link.update(link_params)

SELECT `links`.* FROM `links` WHERE `links`.`id` = 21 LIMIT 1
DELETE FROM `links` WHERE `links`.`id` = 21
---
  def destroy
    @link = Link.find(params[:id])
    @link.destroy