app/controllers/users_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 2) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :username)