app/controllers/users_controller.rb

  def index
    @users = User.all.order(username: :asc)
---
SELECT * FROM `users` ORDER BY username